WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
/****************************************************************************
 * nuttx\configs\stm32f777zit6-meadow\src\hcom_nx\diag\hcom_nx_trace_msg_proc.c
 *
 *   Copyright (C) 2021-2026 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "../hcom_nx_common.h"

#include <meadow/hcom_protocol.h>
#include <meadow/hcom_bbreg_defn.h>
#include <meadow/meadow_cirbuf.h>
#include <meadow/hcom_nuttx_shared.h>
#include "../hcom_nx_config_manager.h"

#include <nuttx/kthread.h>
#include <nuttx/kmalloc.h>

#include <sys/stat.h>
#include <ctype.h>
#include <poll.h>

#include <signal.h>

#include <arch/board/board.h>
#include "stm32_gpio.h"

// #define USE_MEADOW_DEBUG_HELPERS
// // #undef USE_MEADOW_DEBUG_HELPERS
// #include <meadow/meadow_debug_helpers.h>

#if defined (CONFIG_RAMLOG_SYSLOG)
/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define HCOM_TRACE_RAMLOG_ASSUME_LARGEST_SYSLOG (384)
#define HCOM_TRACE_RAMLOG_READ_BUF_SIZE (256)
#define HCOM_TRACE_LOCAL_SYSLOG_CIR_BUF_SIZE (HCOM_TRACE_RAMLOG_READ_BUF_SIZE * 5)
#define HCOM_TRACE_RAMLOG_RECONFIG_TIMEOUT (30)   // Seconds to reconfigure
#define HCOM_TRACE_SHARED_SYSLOG_CIR_BUF_SIZE HCOM_TRACE_LOCAL_SYSLOG_CIR_BUF_SIZE

#define HCOM_TRACE_RAMLOG_SERIAL_PORT_NAME_1 ("/dev/ttyS0")    // UART 1
#define HCOM_TRACE_RAMLOG_SERIAL_PORT_NAME_4 ("/dev/ttyS1")    // UART 4
#define HCOM_TRACE_RAMLOG_SERIAL_PORT_NAME_6 ("/dev/ttyS3")    // UART 6

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Data
 ****************************************************************************/
#endif

static char *thisFile = __FILE__;

// This covers most of this file
#if defined (CONFIG_RAMLOG_SYSLOG)

static bool _shutting_down;
static host_com_cir_buffer_t *_ramlog_cbuf;
// This buffer is where each messages is placed before being sent out
// via uart and/or to CLI. When we must send to CLI a semaphore protects
// this shared memory so we don't need to copy it's data while being sent
// It would be nice if we could just copy the data to a different buffer
// but then there would be a risk that messages would arrive faster than
// CLI can consume them.
static uint8_t *_syslogMsgBuf;
static int _ramlog_fd;
static int _uart_fd;
static bool _trace_kthread_running;
static bool _trace_log_to_host;
static bool _trace_log_to_uart;
static bool _profiler_log_to_uart;
static size_t _cliMsgLength;
static sem_t _startupSem;
static sem_t _readNxtSem;
static sem_t _sendCliSem;
static int _ramlog_reader_kthread_pid;
static uint32_t _txRxReCfgStopTime;

/****************************************************************************
 * Private Functions
 ****************************************************************************/
static void *hcom_nx_trace_msg_kthread(int argc, char *argv[]);
static void hcom_nx_trace_read_bbreg_config(void);
static int hcom_nx_trace_msg_make_thread(void);
static int hcom_nx_trace_msg_open_ramlog(void);
static int hcom_nx_trace_msg_lazy_initialization(void);
static void hcom_nx_trace_msg_close_and_delay(bool ramLogClose);
static int hcom_nx_trace_msg_read_ramlog_loop(uint8_t *readBuf);
static int hcom_nx_trace_msg_save_recvd_data(uint8_t readBuf[], const ssize_t recvByteCnt);
static int hcom_nx_trace_msg_pull_all_packets_from_buffer(void);
static int hcom_nx_trace_msg_route_trace_text(void);
static int hcom_nx_trace_msg_send_msg_to_uart(const char *toUartBuf, size_t numbBytes);
static int hcom_nx_trace_msg_open_uart_serial_port(void);
static void hcom_nx_trace_msg_wait_sem(sem_t *semaphore);
static void hcom_nx_trace_kthread_exit_initiate(void);
static void hcom_nx_trace_kthread_exit_cleanup(void);
static void hcom_nx_trace_msg_sig_recv(int signo, FAR siginfo_t *info, FAR void *context);
static void hcom_nx_uart_direct(int priority, const char *outputMsg, ...);

//=========================================================================
// Returns the current time as a 32-bit number representing millisec time.
static uint32_t hcom_nx_trace_get_time_ms(void)
{
  struct timespec ts;
#ifdef CONFIG_CLOCK_MONOTONIC
  clock_gettime(CLOCK_MONOTONIC, &ts);
#else
  clock_gettime(CLOCK_REALTIME, &ts);
#endif
  return(((uint32_t)ts.tv_sec * MSEC_PER_SEC) + ts.tv_nsec / NSEC_PER_MSEC);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
int hcom_nx_trace_msg_proc_setup()
{
  _trace_kthread_running = false;
  _ramlog_reader_kthread_pid = 0;
  _txRxReCfgStopTime = 0;
  sem_init(&_startupSem, 0, 1);

  // Check the BBR to determine if initialization is needed, but only
  // during startup. After startup, this is controlled by CLI command
  hcom_nx_trace_read_bbreg_config();

  // Follow through with initialization if needed
  if((_trace_log_to_host || _trace_log_to_uart) && !_profiler_log_to_uart)
    hcom_nx_trace_msg_lazy_initialization();
  return OK;
}

//==========================================================================
// This function reads the battery backed register and sets appropriate flags
void hcom_nx_trace_read_bbreg_config()
{
  int bbrRegValue;

  // If started after nuttx start time recheck the battery
  // backed registers as it could have been long ago.
  bbrRegValue = getreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER);
  if((HCOM_BBREG_ROUTE_TRACE_MSG_TO_UART_BIT & bbrRegValue) > 0)
    _trace_log_to_uart = true;
  else
    _trace_log_to_uart = false;

