WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
#if HCOM_FORCE_SYSLOG_MASK_AND_OUTPUT_TO_UART > 0
  _trace_log_to_uart = true;
#endif

  if((HCOM_BBREG_ROUTE_TRACE_MSG_TO_HOST_BIT & bbrRegValue) > 0)
    _trace_log_to_host = true;
  else
    _trace_log_to_host = false;

  if((HCOM_BBREG_ROUTE_PROFILER_BINS_TO_UART_BIT & bbrRegValue) > 0)
    _profiler_log_to_uart = true;
  else
    _profiler_log_to_uart = false;
}

//==========================================================================
// Called when mono starts
int hcom_nx_trace_msg_mono_started()
{
  // When this message is received we know mono has begun running. When mono does
  // begin it will reconfigured all of the GPIOs, including those needed by this
  // code to send messages to the UART. Therefore, we must reconfigures these GPIOs
  // We don't want to do this all the time because there's no reason. So, we'll
  // grab the current time and calculate a reasonable reconfiguration stop time.
  _txRxReCfgStopTime = hcom_nx_trace_get_time_ms();
  _txRxReCfgStopTime += ((uint32_t)HCOM_TRACE_RAMLOG_RECONFIG_TIMEOUT * MSEC_PER_SEC);

  return OK;
}

//==========================================================================
// Because this feature is rarely used we initialize only when requested
// May be called at start or from CLI command or both
int hcom_nx_trace_msg_lazy_initialization()
{
  int ret;

  // Need to guard the thread running flag otherwise may get
  // 2 ramlog reader threads
  hcom_nx_trace_msg_wait_sem(&_startupSem);
  if(_trace_kthread_running)  // Already running? Don't restart
    return OK;

  _ramlog_fd = -1;
  _uart_fd = -1;
  _cliMsgLength = 0;
  _ramlog_reader_kthread_pid = 0;

  // When trace logging is started and uart is able to output messages via
  // uart we'll output one message very early. This message will not be output
  // using syslog but, directly via the uart. This will indicate that Meadow
  // has started. Also, since executed at startup, if the OS crashes, we
  // should still see this message which gives us a clue why no other trace
  // messages follow.
  if(_trace_log_to_uart && !_profiler_log_to_uart)
  {
    struct tm tmNow;
    char timeBuf[64];

    ret = up_rtc_getdatetime(&tmNow);
    if(ret < 0)
    {
      return -EINVAL;
    }

    snprintf_chk(timeBuf, 64, "%02d:%02d:%02d", tmNow.tm_hour, tmNow.tm_min,
              tmNow.tm_sec);

    hcom_nx_uart_direct(0, "\n"HCOM_DEVICE_INFO_PRODUCT " initialization has begun at %s UTC Meadow time. [enq_deq modified]\n", timeBuf);

    // Close uart port because the file descriptor is open by a different thread
    // than the one that will normally handle trace processing.
    close(_uart_fd);
    _uart_fd = -1;
  }

  // These semaphores are needed for sending trace to CLI
  sem_init(&_readNxtSem, 0, 0);
  sem_setprotocol(&_readNxtSem, SEM_PRIO_NONE);

  sem_init(&_sendCliSem, 0, 0);
  sem_setprotocol(&_sendCliSem, SEM_PRIO_NONE);

  // Create a circular buffer instance to manage messages read from ramlog
  _ramlog_cbuf = (host_com_cir_buffer_t *)malloc(sizeof(struct host_com_cir_buffer_s));
  if (_ramlog_cbuf == NULL)
  {
    hcom_nx_uart_direct(LOG_ERR, "%s@%d-cir buf malloc\n", thisFile, __LINE__);
    return -ENOMEM;
  }

  // Initialize the internal circular buffer and use 0x0a as the delimiter.
  // Therefore, every syslog string must be terminate by a new line
  // (i.e '\n' or 0x0a) since they are all the same value 0x0a.
  ret = hcom_cirbuf_init(_ramlog_cbuf, HCOM_TRACE_LOCAL_SYSLOG_CIR_BUF_SIZE, 0x0a);
  if (ret == HCOM_CIR_BUF_ALLOC_FAILED)
  {
    hcom_nx_uart_direct(LOG_ERR, "%s@%d-Cir buf alloc failed\n", thisFile, __LINE__);
    return -1;
  }

  // Message buffer containing full messages pulled from the ramlog
  _syslogMsgBuf = malloc(HCOM_TRACE_RAMLOG_ASSUME_LARGEST_SYSLOG);
  if (_syslogMsgBuf == NULL)
  {
    hcom_nx_uart_direct(LOG_ERR, "%s@%d-cir buf malloc\n", thisFile, __LINE__);
    return -ENOMEM;
  }

  // Create a thread to read the ramlog
  ret = hcom_nx_trace_msg_make_thread();
  if (ret < 0)
  {
    hcom_nx_uart_direct(LOG_ERR, "%s@%d-thread create, errno:%d\n",
              thisFile, __LINE__, errno);

    free(_syslogMsgBuf);
    _syslogMsgBuf = NULL;
    return -1;
  }

  return OK;
}

//=============================================================
// Create a kthread to use as a syslog message reader
int hcom_nx_trace_msg_make_thread()
{
  _ramlog_reader_kthread_pid = kthread_create(HCOM_THREAD_NAME_TRACE_RAMLOG,
                                   HCOM_THREAD_PRIORITY_TRACE_RAMLOG,
                                   HCOM_THREAD_STACKSIZE_TRACE_RAMLOG,
                                   (main_t) hcom_nx_trace_msg_kthread,
                                   (char *const *) NULL);
  if (_ramlog_reader_kthread_pid <= 0)
  {
      return -ENOEXEC;
  }

  return OK;
}

//=================================================================
// This thread reads all ramlog messages received via syslog from
// the ramlog buffer and routes them to the UART and CLI. This
// thread once started is not stopped until F7 reset.
void *hcom_nx_trace_msg_kthread(int argc, char *argv[])
{
  int ret;
  uint8_t *readBuf;
  struct sigaction act;

  _trace_kthread_running = true;
  _shutting_down = false;
  sem_post(&_startupSem);

  readBuf = malloc(HCOM_TRACE_RAMLOG_READ_BUF_SIZE);
  if(readBuf == NULL)
  {
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", thisFile, __LINE__);
    return NULL;
  }

#if HCOM_DIAG_OUTPUT_SYSLOG_PID_OF_NEW_THREADS > 0
  syslog(LOG_MDIAG, "New kthread [PID:%d],'%s'\n",
    getpid(), HCOM_THREAD_NAME_TRACE_RAMLOG);
#endif

  // Attach a signal handler to catch the kill command
  act.sa_sigaction = hcom_nx_trace_msg_sig_recv;
  act.sa_flags = SA_SIGINFO;
  sigemptyset(&act.sa_mask);

  ret = sigaction(SIGALRM, &act, NULL);
  if (ret < 0)
  {
    _trace_kthread_running = false;
    free(readBuf);
    return NULL;
  }

  //-------------------------------------------
  // Only leave this loop when shutting down
  while(!_shutting_down)
  {
    // Must have ramlog, it's the source of all trace info
    ret = hcom_nx_trace_msg_open_ramlog();
    if(_shutting_down) break;
    if(ret < 0)
    {
      hcom_nx_trace_msg_close_and_delay(false);
      continue;
    }

    // Open uart if it's requested
    if(_trace_log_to_uart && !_profiler_log_to_uart)
    {
      ret = hcom_nx_trace_msg_open_uart_serial_port();
      if(_shutting_down) break;
      if(ret < 0)
      {
        hcom_nx_trace_msg_close_and_delay(false);
        continue;
      }
    }

    // Attempt to read from the ramlog buffer
    ret = hcom_nx_trace_msg_read_ramlog_loop(readBuf);
    if(_shutting_down) break;
    if(ret < 0)
    {
      hcom_nx_trace_msg_close_and_delay(true);
    }
  }
  //-------------------------------------------

  // Time for this thread to exit
  hcom_nx_trace_kthread_exit_cleanup();

  _trace_kthread_running = false;
  free(readBuf);

