WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
  return NULL;
}

//=================================================================
// Need a signal handler or the default Nuttx behavior kicks in
void hcom_nx_trace_msg_sig_recv(int signo, FAR siginfo_t *info, FAR void *context)
{
  return;
}

//==========================================================================
// Initiate the kthread exit.
void hcom_nx_trace_kthread_exit_initiate()
{
  // A pthread cannot kill a kthread so we must indirectly kill the thread
  // by setting _shutting_down true, closing connections and waiting
  _shutting_down = true;

  // Make sure the semaphores won't block the exiting of either thread
  sem_post(&_readNxtSem);
  sem_post(&_sendCliSem);

  // Signal the kthread so _shutting_down will be tested, forcing it to exit
  kill(_ramlog_reader_kthread_pid, SIGALRM);

  // Nuttx kthreads have no 'join' functionality. We stay in this loop
  // until the exiting kthread has cleaned up it's resources.
  while(_trace_kthread_running)
  {
    usleep(10 * 1000);
  }

  sem_destroy(&_readNxtSem);
  sem_destroy(&_sendCliSem);
}

//==========================================================================
// This function is called by the kthread just before it exits
// and is used to reclaim resources
void hcom_nx_trace_kthread_exit_cleanup()
{
  _trace_log_to_uart = false;
  _trace_log_to_host = false;
  _profiler_log_to_uart = false;

  close(_ramlog_fd);
  _ramlog_fd = -1;

  close(_uart_fd);
  _uart_fd = -1;

  if(_ramlog_cbuf != NULL)
  {
    hcom_cirbuf_release_memory(_ramlog_cbuf);
    free(_ramlog_cbuf);
    _ramlog_cbuf = NULL;
  }

  if(_syslogMsgBuf != NULL)
  {
    free(_syslogMsgBuf);
    _syslogMsgBuf = NULL;
  }
}

//=================================================================
void hcom_nx_trace_msg_close_and_delay(bool ramLogClose)
{
  if(ramLogClose)
  {
    close(_ramlog_fd);
    _ramlog_fd = -1;
  }

  if(_uart_fd > -1)
  {
    close(_uart_fd);
    _uart_fd = -1;
  }

  // Wait and try again
  if(!_shutting_down)
    usleep(100 * 1000);   // Not a special value, just prevent hard infinite looping
}

//=================================================================
int hcom_nx_trace_msg_open_ramlog()
{
  if(_ramlog_fd > -1)
  {
    close(_ramlog_fd);
    _ramlog_fd = -1;
  }

  _ramlog_fd = open(HCOM_TRACE_RAMLOG_DEVICE_NAME, O_RDONLY);
  if(_shutting_down) return OK;
  if (_ramlog_fd < 0)
  {
    hcom_nx_uart_direct(LOG_ERR, "%s@%d-open %s, errno:%d\n",
            thisFile, __LINE__, HCOM_TRACE_RAMLOG_DEVICE_NAME, errno);
    return -1;
  }

  return OK;
}

//=================================================================
int hcom_nx_trace_msg_open_uart_serial_port()
{
  if(_uart_fd > -1)
  {
    close(_uart_fd);
    _uart_fd = -1;
  }

#if HCOM_DIAG_SYSLOG_UART_NUMBER == 1
  _uart_fd = open(HCOM_TRACE_RAMLOG_SERIAL_PORT_NAME_1, O_WRONLY);
#elif HCOM_DIAG_SYSLOG_UART_NUMBER == 4
  _uart_fd = open(HCOM_TRACE_RAMLOG_SERIAL_PORT_NAME_4, O_WRONLY);
#elif HCOM_DIAG_SYSLOG_UART_NUMBER == 6
  _uart_fd = open(HCOM_TRACE_RAMLOG_SERIAL_PORT_NAME_6, O_WRONLY);
#else
#error "Must select a valid syslog uart"
#endif

  if(_shutting_down) return OK;
  if (_uart_fd < 0)
  {
    _uart_fd = -1;
    return -1;
  }
  return OK;
}

//=================================================================
// This function reads the data put into the ramlog by Nuttx
// Returning on error will close the uart connection
int hcom_nx_trace_msg_read_ramlog_loop(uint8_t *readBuf)
{
  ssize_t readReturn;
  int ret;

  while(!_shutting_down)
  {
    // Read ramlog
    readReturn = read(_ramlog_fd, readBuf, HCOM_TRACE_RAMLOG_READ_BUF_SIZE);
    if(_shutting_down) break;
    if (readReturn < 0 )
    {
      // Error
      hcom_nx_uart_direct(LOG_ERR, "%s@%d ramlog read readReturn:%d errno:%d\n",
              thisFile, __LINE__, readReturn, errno);
      return -errno;    // Close connection, wait and try again
    }
    else if (readReturn == 0)
    {
      // EOF
      hcom_nx_uart_direct(LOG_WARNING, "%s@%d ramlog read EOF read returned:%d errno:%d\n",
              thisFile, __LINE__, readReturn, errno);
      return -errno;    // Close connection, wait and try again
    }
    else
    {
      // Successful ramlog message read. Put message into circular buffer
      // unless all logging has been turned off
      if(_trace_log_to_host || _trace_log_to_uart)
      {
        ret = hcom_nx_trace_msg_save_recvd_data(readBuf, readReturn);
        if (ret < 0 )
        {
          hcom_nx_uart_direct(LOG_WARNING, "%s@%d hcom_nx_trace_msg_save_recvd_data() returned:%d\n",
                    thisFile, __LINE__, ret);
          return ret;    // Close connection, wait and try again
        }
      }
    }
  }   // while (!_shutting_down)

  return OK;
}

//=======================================================================
// Add the data read from ramlog into a circular buffer. It can be added
// byte by byte or several bytes at once.
// We assume that the message itself will be delimited with 0x0a
// (AKA 'line feed' or '\n'). If not multiple messages will be output together
int hcom_nx_trace_msg_save_recvd_data(uint8_t readBuf[], const ssize_t recvByteCnt)
{
  int addResult;
  int pullResult;

  if (recvByteCnt == 0)
    return OK;

  // This loop is used to add received data and read all available data to/from
  // the buffer until no more will fit
  while(!_shutting_down)
  {
    // Can return HCOM_CIR_BUF_ADD_SUCCESS, HCOM_CIR_BUF_ADD_WONT_FIT, HCOM_CIR_BUF_ADD_BAD_ARG,
    addResult = hcom_cirbuf_add_bytes(_ramlog_cbuf, readBuf, recvByteCnt);
    if(_shutting_down) break;
    if(addResult == HCOM_CIR_BUF_ADD_SUCCESS)
    {
      break;    // Leave loop and check for data ready to read
    }
    else if (addResult == HCOM_CIR_BUF_ADD_WONT_FIT)
    {
      // The buffer doesn't have room for these bytes. We need to pull messages
      // and retry to add this data Only returns -error, HCOM_CIR_BUF_GET_NONE_FOUND
      // or HCOM_CIR_BUF_GET_DELETED_TOO_BIG
      pullResult = hcom_nx_trace_msg_pull_all_packets_from_buffer();
      if(_shutting_down) break;
      if (pullResult == HCOM_CIR_BUF_GET_FOUND_MSG)
      {
        // Pulled and processed some message so attempt to add again
        continue;
      }

      if (pullResult == HCOM_CIR_BUF_GET_NONE_FOUND)
      {
        // This makes no sense. Like a buffer full of garbage and no delimiter
        hcom_cirbuf_clear_buffer(_ramlog_cbuf);

