WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
        hcom_nx_uart_direct(LOG_ERR, "%s@%d-buffer corrupted or messages w/o linefeed. Deleted data.\n",
                 thisFile, __LINE__);
        
        return HCOM_CIR_BUF_GET_NONE_FOUND;    // Reported so throw data away.
      }

      if (pullResult == HCOM_CIR_BUF_GET_DELETED_TOO_BIG)
      {
        // The message was too long for the allocated buffer and has been deleted.
        hcom_nx_uart_direct(LOG_ERR, "%s@%d-pull packets from cir buf, msg too long, deleted\n",
                 thisFile, __LINE__);
        return pullResult;    // Reported and deleted.
      }
    }
    else if (addResult == HCOM_CIR_BUF_ADD_BAD_ARG)
    {
      // A bad argument is never expected
      hcom_nx_uart_direct(LOG_ERR, "%s@%d-Bad argument to cir buf\n", thisFile, __LINE__);
      return addResult; // Report, throw data away and keep going
    }
    else
    {
      // Undefined error????
      hcom_nx_uart_direct(LOG_ERR, "%s@%d-Unknown cir buf add err:%d\n", thisFile, __LINE__, addResult);
      return addResult; // Report, throw data away and keep going
    }
  }   // while(!_shutting_down)

  // Check if there's more complete message(s) buffered
  pullResult = hcom_nx_trace_msg_pull_all_packets_from_buffer();
  return pullResult;
}

//====================================================================
// Pull and process all the complete packets from the circular buffer
// Returns -error or one of the circular buffer get return values
int hcom_nx_trace_msg_pull_all_packets_from_buffer()
{
  int ret;
  size_t packetLength;

  while(!_shutting_down)
  {
    // If buffer too small for the found message packetLength will contain
    // the needed buffer size.
    ret = hcom_cirbuf_get_next_packet(_ramlog_cbuf, _syslogMsgBuf,
            HCOM_TRACE_RAMLOG_ASSUME_LARGEST_SYSLOG, &packetLength);
    if(_shutting_down) break;

    // Any messages available?
    if (ret == HCOM_CIR_BUF_GET_NONE_FOUND)
    {
      return ret; // Buffer empty, return to get more data
    }

    if(ret == HCOM_CIR_BUF_GET_DELETED_TOO_BIG)
    {
      // The message was too long.
      // Probably corrupted data or no linefeed at end of messages
      hcom_cirbuf_clear_buffer(_ramlog_cbuf);

      hcom_nx_uart_direct(LOG_ERR, "%s@%d-message %d long or w/o linefeed, deleted\n",
                thisFile, __LINE__, packetLength);

      return ret; // _syslogMsgBuf too small, throw away data and keep going 
    }
    
    // Circular Buffer ret must have been HCOM_CIR_BUF_GET_FOUND_MSG
    _cliMsgLength = packetLength;

    // Route the isolated message
    ret = hcom_nx_trace_msg_route_trace_text();
    if(_shutting_down) break;
    if (ret == OK)
    {
      continue; // pull next packet, if there is one
    }
    else
    {
      hcom_nx_uart_direct(LOG_ERR, "%s@%d-processing data:%d\n", thisFile, __LINE__, ret);
      return HCOM_CIR_BUF_GET_NONE_FOUND;   // Assume buffer empty
    }
  }   // while(!_shutting_down)
  
  return HCOM_CIR_BUF_GET_FOUND_MSG;
}

//=================================================================
// Ship the ramlog text message to uart and/or host CLI
// If this function cannot send it, the message is lost....
int hcom_nx_trace_msg_route_trace_text(void)
{
  int ret;

  if(_trace_log_to_uart)
  {
    // Route to uart
    ret = hcom_nx_trace_msg_send_msg_to_uart((char *) _syslogMsgBuf, _cliMsgLength);
    if(ret < 0)
    {
      return ret;
    }
  }

  if(_trace_log_to_host)
  {
    // Route to CLI
    // Release CLI pthread to return the  message in the buffer it provided,
    // to the CLI
    sem_post(&_sendCliSem);

    // Wait for message to be sent before getting next message. Why? Because
    // the _syslogMsgBuf buffer is a shared resource.
    hcom_nx_trace_msg_wait_sem(&_readNxtSem);
  }

  return OK;
}

//==========================================================================
// This is called via udp and provides a pthread, and the buffer for the
// trace message to CLI. On every call it waits for the next message.
// When a message is found it returns and calls the code to send
// the trace message to CLI and returns again.
size_t hcom_nx_trace_cli_trace_transport(char *buff, size_t buffLen)
{
  static bool firstTime = true;
  size_t msgLength;

  // The first call must be ignored. Afterward we allow the reader to get the
  // to keep things in sync.
  if(firstTime)
  {
    firstTime = false;
  }
  else
  {
    // The caller of this function has returned, indicating that the message
    // has been sent to the CLI. Therefore, allow the ramlog reader thread
    // to get the next message
    sem_post(&_readNxtSem);
  }

  // Wait for the next messge to be provided for CLI
  hcom_nx_trace_msg_wait_sem(&_sendCliSem);
  if(_shutting_down)
    return 0;

  // Truncate the message if too long for caller's buffer
  if(_cliMsgLength > buffLen)
    msgLength = buffLen;
  else
    msgLength = _cliMsgLength;

  // Currently the 2 threads run in a ping-pong fashion, only one can run
  // at a time. With some effort, once the data has been copied to the userland
  // buffer, the ramlog reader could be allowed to read the next message.
  // But, at this time the effort doesn't seem to be worth the benefit.
  memcpy(buff, _syslogMsgBuf, msgLength);

  // Return to userland with the message
  return msgLength;
}

//==========================================================================
// There's really isn't a good way to handle errors with ramlog because errors
// cannot be written to syslog or we'll end up with an infinite loop. So,
// the best we can do is send them to UART, and hope it's being watched.
//--------------------------------------------------------------------------
// Send a string directly to uart. The priority value is not used but makes
// this function signature like syslog so that this can be used as a substitute
// for syslog.
// Note:This function can ONLY be called from a kthread.
// Note:Calling from a userland pthread will CRASH Nuttx.
void hcom_nx_uart_direct(int priority, const char *fmt, ...)
{
#define HCOM_NX_UART_DIRECT_BUF_LEN (256)
  va_list ap;
  int stringLen;

