WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
  char *completeStr;
  completeStr = malloc(HCOM_NX_UART_DIRECT_BUF_LEN);
  if(completeStr == NULL)
  {
    // Can't do anything else at this point
    return;
  }

  // Create the complete message
  va_start(ap, fmt);

  // Returned value is the string length, including '\0'. But, if buffer is too
  // small the returned value is the needed buffer length excluding terminating
  // '\0'. However, sending direct to uart means a '\0' is not needed anyway.
  stringLen = vsnprintf(completeStr, HCOM_NX_UART_DIRECT_BUF_LEN, fmt, ap);
  va_end(ap);

  // We need the actual length. So if truncated we'll use the buffer's length
  if(stringLen > HCOM_NX_UART_DIRECT_BUF_LEN)
    stringLen = HCOM_NX_UART_DIRECT_BUF_LEN;

  hcom_nx_trace_msg_send_msg_to_uart(completeStr, stringLen);
  
  // Need a carriage return which we usually don't add
  hcom_nx_trace_msg_send_msg_to_uart("\r", 1);
  free(completeStr);
}

//==========================================================================
// Forward the message to the uart for transmission
int hcom_nx_trace_msg_send_msg_to_uart(const char *toUartBuf, size_t numbBytes)
{
  // If uart not opened do this now
  if(_uart_fd < 0 && !_profiler_log_to_uart)
  {
    int ret = hcom_nx_trace_msg_open_uart_serial_port();
    if(ret < 0)
    {
      return ret;
    }
  }

  // Because the mono/meadow runtime may reconfigure all the GPIOs used by the board
  // we need to reconfigure them after mono starts. The problem is we don't know when
  // this is is. Therefore, we execute this code for a predetermined amount of time,
  // starting when mono has started running.
  if(_txRxReCfgStopTime != 0)
  {
    // [--] THE FOLLOWING MAY NEED TO BE REMOVED OR CHANGED
    // Reconfigure uart (takes about 32usec to do all 4 commands)
#if HCOM_DIAG_SYSLOG_UART_NUMBER == 1
    stm32_unconfiggpio(GPIO_USART1_TX); // PB14
    stm32_configgpio(GPIO_USART1_TX);
    stm32_unconfiggpio(GPIO_USART1_RX); // PB15
    stm32_configgpio(GPIO_USART1_RX);
#elif HCOM_DIAG_SYSLOG_UART_NUMBER == 4
    stm32_unconfiggpio(GPIO_UART4_RX); // PI9
    stm32_configgpio(GPIO_UART4_RX);
    stm32_unconfiggpio(GPIO_UART4_TX); // PH13
    stm32_configgpio(GPIO_UART4_TX);
#elif HCOM_DIAG_SYSLOG_UART_NUMBER == 6
    stm32_unconfiggpio(GPIO_USART6_RX); // PC7
    stm32_configgpio(GPIO_USART6_RX);
    stm32_unconfiggpio(GPIO_USART6_TX); // PC6
    stm32_configgpio(GPIO_USART6_TX);
#else
#error "Must select a valid syslog uart"
#endif

    // Run until stop time is exceeded then stop the process
    if(_txRxReCfgStopTime < hcom_nx_trace_get_time_ms())
    {
      _txRxReCfgStopTime = 0;      // Past so timeout no longer needed
    }
  }

  // Write string out the uart
  ssize_t nbytes = write(_uart_fd, toUartBuf, numbBytes);
  if (nbytes < 0)
  {
    return nbytes;
  }

  return OK;
}

//===========================================================================
// Wait for the thread holding the semaphore to release it
void hcom_nx_trace_msg_wait_sem(sem_t *semaphore)
{
  int ret;  

  do
  {
    ret = sem_wait(semaphore);    // Take the semaphore (perhaps waiting)
  }
  while (ret == -EINTR);
}

#endif    // #if defined (CONFIG_RAMLOG_SYSLOG)

//======================================================================================
// The following functions are always built. They are used to process
// hcom commands received from CLI that control the tracing feature.
//======================================================================================
//
// Called from Meadow.CLI to enable tracing to host.
int hcom_nx_exec_trace_do_send_to_host(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;
  
  // Set the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              0, HCOM_BBREG_ROUTE_TRACE_MSG_TO_HOST_BIT);

  // If ramlog configured, need to init ramlog now. This insures
  // that Meadow.CLI is listening
#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_host)
  {
    sendMsgToHost = "No change. Trace logs already sent to CLI";
  }
  else
  {
    _trace_log_to_host = true;

    // Initialize as needed
    hcom_nx_trace_msg_lazy_initialization();

    if(_trace_log_to_uart)
      sendMsgToHost = "Trace logs now sent to CLI and UART";
    else
      sendMsgToHost = "Trace logs now sent to CLI";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);
  return OK;
}

//======================================================================================
// Called from Meadow.CLI for ramlog output to host
int hcom_nx_exec_trace_do_not_send_to_host(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;

  // Clear the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              HCOM_BBREG_ROUTE_TRACE_MSG_TO_HOST_BIT, 0);

#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_host)
  {
    // Disable ramlogs to host
    _trace_log_to_host = false;

    if(!_trace_log_to_uart)
    {
      // Since no longer needed, terminate the main ramlog reader thread
      // and clean up it's resources
      hcom_nx_trace_kthread_exit_initiate();
      sendMsgToHost = "Trace logging will be terminated";
    }
    else
    {
      // When CLI sending stops we need to do a bit more cleanup.
      sem_post(&_sendCliSem);     // Allow userland pthread to return and exit
      sem_post(&_readNxtSem);     // Allow ramlog thread to leave
                                  // 'if(_trace_log_to_host)' block.

      sendMsgToHost = "Will no longer send trace logs to CLI";
    }
  }
  else
  {
    sendMsgToHost = "No change. Trace logs still not sent to CLI";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);

  return OK;
}

//======================================================================================
// [--] Called from Meadow.CLI to enable tracing to uart.
int hcom_nx_exec_trace_forward_to_uart(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;
  
  // Set the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              0, HCOM_BBREG_ROUTE_TRACE_MSG_TO_UART_BIT);

  // If ramlog configured, need to init ramlog now. This insures
  // that Meadow.CLI is listening
#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_uart)
  {
    sendMsgToHost = "No change. Trace logs already sent to UART";
  }
  else
  {
    _trace_log_to_uart = true;

    // Initialize if needed
    hcom_nx_trace_msg_lazy_initialization();

    if(_trace_log_to_host)
      sendMsgToHost = "Trace logs now sent to UART and CLI";
    else
      sendMsgToHost = "Trace logs now sent to UART";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);

  return OK;
}

//======================================================================================
// [--] Called from Meadow.CLI to stop ramlog output to uart
int hcom_nx_exec_trace_do_not_send_to_uart(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;

  // Clear the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              HCOM_BBREG_ROUTE_TRACE_MSG_TO_UART_BIT, 0);

#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_trace_log_to_uart)
  {
    _trace_log_to_uart = false;

