WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/diag/hcom_nx_trace_msg_proc.c
    if(!_trace_log_to_host)
    {
      // Since no longer needed, terminate the main ramlog reader thread
      // and clean up it's resources
      hcom_nx_trace_kthread_exit_initiate();

      sendMsgToHost = "Trace logging will be terminated";
    }
    else
    {
      sendMsgToHost = "Will no longer send trace logs to UART";
    }
  }
  else
  {
    sendMsgToHost = "No change. Trace logs still not sent to UART";
  }
#else
  sendMsgToHost = "Trace logging not available";
#endif
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
            sendMsgToHost, thisFile, __LINE__);
  
  return OK;
}

//======================================================================================
// Called from Meadow.CLI to enable profiling data output to uart.
int hcom_nx_exec_profiler_forward_to_uart(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;
  
   // Set the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              0, HCOM_BBREG_ROUTE_PROFILER_BINS_TO_UART_BIT);

  // If ramlog configured, need to init ramlog now. This insures
  // that Meadow.CLI is listening
#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_profiler_log_to_uart)
  {
    sendMsgToHost = "No change. UART is still exclusive for profiling data";
  }
  else
  {
    _profiler_log_to_uart = true;
    sendMsgToHost = "UART is now exclusive for profiling data";
  }
#else
  sendMsgToHost = "Profiler logging not available";
#endif

  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0, sendMsgToHost,
          thisFile, __LINE__);

  return OK;
}

//======================================================================================
// Called from Meadow.CLI to disable profiling data output to uart
int hcom_nx_exec_profiler_do_not_send_to_uart(struct hcom_nx_cmd_data *cmdData)
{
  char *sendMsgToHost;

  // Clear the appropriate battery backed register bit
  modifyreg32(HCOM_NX_MEADOW_BATTERY_BACKED_REGISTER,
              HCOM_BBREG_ROUTE_PROFILER_BINS_TO_UART_BIT, 0);

#if defined (CONFIG_RAMLOG_SYSLOG)
  if(_profiler_log_to_uart)
  {
    _profiler_log_to_uart = false;
    sendMsgToHost = "UART not exclusive for profiler, profiling data might still be visible if enabled in Mono.";
  }
  else
  {
    sendMsgToHost = "No change. UART still not exclusive for profiler, profiling data might still be visible if enabled in Mono";
  }
#else
  sendMsgToHost = "Profiler logging not available";
#endif
  cmdData->send_host_msg(HCOM_HOST_REQUEST_TEXT_INFORMATION, 0,
            sendMsgToHost, thisFile, __LINE__);
  
  return OK;
}

//======================================================================================
// Called by meadow configuration after it has started. Once the meadow configuration
// has been parsed this method is called if it determines tracing should be enabled.
void hcom_nx_trace_insure_correct_config(bool uartTracing, bool cliTracing, bool uartProfiling)
{
#if defined (CONFIG_RAMLOG_SYSLOG)

  if (uartProfiling)
  {
    _profiler_log_to_uart = true;
    _trace_log_to_uart = false;
    return;
  }

  bool needToInit = false;

  if(uartTracing && (!_trace_log_to_uart))
  {
    _trace_log_to_uart = true;
    needToInit = true;
  }

  if(cliTracing && (!_trace_log_to_host))
  {
    _trace_log_to_host = true;
    needToInit = true;
  }

  // At startup this initialization would not have been called so do it now
  if(needToInit)
  {
    hcom_nx_trace_msg_lazy_initialization();
  }

#endif
}
